namespace TaskIntro.MyClasses
{
    public class Validator
    {
        //         Реализуйте класс Validator. У него будет метод IsEmail параметром принимает
        // строку и проверяет, является ли она корректным емейлом или нет. Если является
        // - возвращает true, если не является - то false.
        // Дополнить 5 задание. Добавить метод IsURL для проверки на url.
        // Дополнить 5 задание. Добавить метод IsDate для проверки на дату.
        // Дополнить 5 задание. Добавить метод IsPhone для проверки на номер телефона

        // private string Text = "hello Validator";
        public Validator()
        {

        }

        public static void Print()
        {
            Console.WriteLine("Text");
        }
    }
}