namespace Abstract;
// Реализовать класс Validation который содержит методы IsValidId, IsValidEmail,
// IsValidPwd.
// Реализовать класс наследник Data который полностью переопределяет все
// методы своего суперкласса.
// Ваша задача написать функционал для всех трёх методов.
// Где, основная задача первого метода проверить является ли входное значение
// принимаемые в параметры функции числом.
// Основная задача второго метода проверить является ли входная строка почтой:
// то есть содержит ли знак «@» а также оканчивается ли на .by, .com
// Говоря о последнем методе то он принимает две строки: пароль и
// подтверждения пароля. Необходимо проверить совпадают ли данный пароли.
// Результат каждой из функций должен возвращать true или false в зависимости от
// условий
